       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.

       PROCEDURE DIVISION.
           DISPLAY "this is the COBOL main program"
           CALL 'hello'
           CALL 'world'
           GOBACK
           .
