       IDENTIFICATION DIVISION.
       PROGRAM-ID. world.

       PROCEDURE DIVISION.
           DISPLAY "WORLD from COBOL"
           GOBACK
           .
